# STEP 6: Repeat the computation from the facts & dimension table

Note: You will not have to write any code in this notebook. It's purely to illustrate the performance difference between Star and 3NF schemas.

Start by running the code in the cell below to connect to the database.

In [7]:
# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila_star
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila_star -f Data/pagila-data.sql

# !PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
# !PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

createdb: database creation failed: ERROR:  database "pagila_star" already exists

In [9]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

## 6.1 Facts Table has all the needed dimensions, no need for deep joins

In [11]:
%%time
%%sql
SELECT movie_key, date_key, customer_key, sales_amount
FROM factsales 
limit 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
5 rows affected.
CPU times: user 0 ns, sys: 2.97 ms, total: 2.97 ms
Wall time: 6.16 ms

[(870, 20170124, 269, Decimal('1.99')),
 (651, 20170125, 269, Decimal('0.99')),
 (818, 20170128, 269, Decimal('6.99')),
 (249, 20170129, 269, Decimal('0.99')),
 (159, 20170129, 269, Decimal('4.99'))]

## 6.2 Join fact table with dimensions to replace keys with attributes

As you run each cell, pay attention to the time that is printed. Which schema do you think will run faster?

##### Star Schema

In [14]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie    on (dimMovie.movie_key      = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
group by (dimMovie.title, dimDate.month, dimCustomer.city)
order by dimMovie.title, dimDate.month, dimCustomer.city, revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
10 rows affected.
CPU times: user 6.63 ms, sys: 0 ns, total: 6.63 ms
Wall time: 268 ms

[('ACADEMY DINOSAUR', 1, 'Celaya', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 1, 'Cianjur', Decimal('9.95')),
 ('ACADEMY DINOSAUR', 2, 'San Lorenzo', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 2, 'Sullana', Decimal('9.95')),
 ('ACADEMY DINOSAUR', 2, 'Udaipur', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 3, 'Almirante Brown', Decimal('9.95')),
 ('ACADEMY DINOSAUR', 3, 'Goinia', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 3, 'Kaliningrad', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 3, 'Kurashiki', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 3, 'Livorno', Decimal('4.95'))]

##### 3NF Schema

In [15]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, month, ci.city)
order by f.title, month, ci.city, revenue desc
limit 10;

 * postgresql://student:***@127.0.0.1:5432/pagila
   postgresql://student:***@127.0.0.1:5432/pagila_star
10 rows affected.
CPU times: user 8.13 ms, sys: 0 ns, total: 8.13 ms
Wall time: 308 ms

[('ACADEMY DINOSAUR', 1.0, 'Celaya', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 1.0, 'Cianjur', Decimal('9.95')),
 ('ACADEMY DINOSAUR', 2.0, 'San Lorenzo', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 2.0, 'Sullana', Decimal('9.95')),
 ('ACADEMY DINOSAUR', 2.0, 'Udaipur', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 3.0, 'Almirante Brown', Decimal('9.95')),
 ('ACADEMY DINOSAUR', 3.0, 'Goinia', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 3.0, 'Kaliningrad', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 3.0, 'Kurashiki', Decimal('4.95')),
 ('ACADEMY DINOSAUR', 3.0, 'Livorno', Decimal('4.95'))]

# Conclusion

We were able to show that:
* The star schema is easier to understand and write queries against.
* Queries with a star schema are more performant.